app/controllers/songs_controller.rb

  def edit
    if params[:artist_id] && !Artist.exists?(params[:artist_id])
---
SELECT "artists".* FROM "artists"